
import { AppFooter } from '@/components/landing-page/footer';
import Link from 'next/link';

export default function PrivacyPolicyPage() {
  return (
    <div className="relative bg-background">
      <div className="bg-soft-smoke" />
      <main className="container mx-auto px-4 md:px-6 py-16 md:py-24 z-10">
        <div className="max-w-4xl mx-auto bg-card p-8 md:p-12 rounded-2xl shadow-lg">
          <h1 className="font-headline text-3xl md:text-4xl font-bold mb-8">Политика за защита на личните данни</h1>
          <div className="space-y-4 text-muted-foreground">
            <p>Платформата https://moqtabremennost.netlify.app/ (наричан по-долу Доставчикът) осъществява дейността си в съответствие със Закона за защита на личните данни и Регламент (ЕС) 2016/679 на Европейския парламент и на Съвета от 01 октомври 2015 година относно защитата на физическите лица във връзка с обработването на лични данни и относно свободното движение на такива данни.</p>
            <p>Ние уважаваме вашата конфиденциалност и се ангажираме със защитата на личните данни, които ни предоставяте. В тази връзка, бихме искали да споделим с вас принципите, които формират нашата политика.</p>
            <p>На сайта https://moqtabremennost.netlify.app/ се събира определена информация. Този документ („Политика за защита на личните данни“) описва нашите политики и процедури, регламентиращи събирането и обработването на тази информация, която идентифицира индивидуален ползвател и може да бъде използвана за контакт с него („Лични данни“, „Лична информация“).</p>
            <div>
              <p>Контрол върху нашите дейности, свързани с лични данни, упражнява следният административен орган:</p>
              <p>Комисия за защита на личните данни (КЗЛД)</p>
              <p>Адрес: София 1431, бул. „Акад. Иван Евстратиев Гешов” 15</p>
              <p>Тел: + 359 2 915 35 18</p>
              <p>Факс: + 359 2 915 35 25</p>
              <p>Ел. поща: kzld@government.bg, kzld@cpdp.bg</p>
              <p>Уебсайт: www.cpdp.bg</p>
            </div>
            <h2 className="font-semibold text-xl text-foreground pt-4">Събиране на лична информация</h2>
            <p>Ние събираме лична информация, за да отговорим на вашите искания свързани с мисията на платформата.</p>
            <p>Ние събираме следната лична информация от използващите Услугата Ползватели:</p>
            <ul className="list-disc list-inside space-y-1">
              <li>Директно чрез Уебсайта: име, фамилия, електронна поща, адрес и телефон – за тези, които осъществят покупка през сайта и за тези, които не осъществят покупка, но въведат данните си в сайта.</li>
              <li>Посредством Google Analytics и Facebook Pixel – данни за трафика и поведението на Ползвателите.</li>
            </ul>
            <p>Нуждаем се от тази информация, за да можем да осъществим продажба и да доставим до вас поръчания артикул, т.е. личните данни са необходими за сключването и изпълнението на договора за продажба.</p>
            <p>Цялата изброена информация ще бъде запазена и може да бъде използвана за маркетингови/рекламни цели.</p>
            <p>Възможно е да изискаме и допълнителна информация, но само при изрично позволение от ваша страна или в случай, че тази информация е необходима за изпълнението на услугата, която сте заявили. Вие сте единствен притежател на вашата лична информация.</p>
            <p>Използвайки нашата Услуга, вие изрично се съгласявате вашите лични данни да бъдат събирани и обработвани от нас, като същевременно с това гарантирате тяхната точност и достоверност. Вие също така декларирате, че сте били информирани за типа лични данни, които събираме и обработваме, за целите, за които ще бъдат използвани те, както и за Вашето право на достъп, коригиране или изтриване на събраните лични данни.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">ЦЕЛИ НА ОБРАБОТКАТА НА ДАННИТЕ</h2>
            <p>С поръчката от https://moqtabremennost.netlify.app/ ние сключваме с Вас договор за продажба. Основната цел, която събираме и използваме горепосочените лични данни, е да направим възможно изпълнението на този договор – включително изпращането на стоката до Вас.</p>
            <p>Имейл адресът и телефонът, който сте ни предоставили, могат да бъдат използвани за целите на директния маркетинг включително, но не ограничено до осъществяне на телефонни обаждания с предложения за покупка на допълнителни стоки или услуги, изпращане на имейл бюлетин, в които случаи правните основания за обработката биха представлявали легитимен интерес съгласно чл. 6, ал. 1, буква “е” на Общия регламент за защита на данните /GDPR/.</p>
            <p>Вашите лични данни могат също така да бъдат обработвани, ако държавен орган се нуждае от сътрудничество във връзка с различни официални производства, включително досъдебни, съдебни и административни производства, свързани с искове и спорове на потребители, измами и др.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">ПЕРИОД, ЗА КОЙТО СЕ СЪХРАНЯВАТ ЛИЧНИТЕ ДАННИ</h2>
            <p>Личните данни, посочени по-горе, се съхраняват за неопределен период от време. Винаги можете да поискате да престанем да обработваме личните ви данни, като се свържете с нас на 1001knigi@gmail.com.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">АВТОМАТИЗИРАНА ОБРАБОТКА НА ДАННИ ЧРЕЗ БИСКВИТКИ</h2>
            <p>Може да събираме Ваши лични данни посредством бисквитки.</p>
            <p><strong>Употреба на вашите лични данни</strong></p>
            <p>Ние използваме вашите лични данни, за да ви предоставим възможност за достъп до Уебсайта, за да ви изпращаме нашия редовен бюлетин и да ви предлагаме допълнителни услуги и събития включително чрез телефонно обаждане, за да ви предоставим цялостно обслужване и да ви предоставим услугата, която очаквате.</p>
            <p>Вие имате право:</p>
            <ul className="list-disc list-inside space-y-1">
              <li>Да получите файл, съдържащ всички ваши лични данни, които съхраняваме.</li>
              <li>Да откажете вашите лични данни да бъдат използвани от нас.</li>
              <li>Да поискате коригиране на своите лични данни.</li>
            </ul>
            <p>За да упражните описаните по-горе свои права, можете да се свържете с нас на 1001knigi@gmail.com.</p>
            <p>Ние бихме могли да използваме ваша информация, за да създадем обобщена статистика, която е анонимна, както и за да извършим базиран на нея статистически анализ.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Съхранение на данни от трети страни</h2>
            <p>Използваме услуги на трети страни, за да поддържаме уеб сайта онлайн, да подобрим работата на уеб сайта и да управляваме по-добре предоставяната Услуга. Възможно е някоя от тези услуги да съхранява данни на сървър, който се намира извън територията на Република България.</p>
            
            <p><strong>Google Analytics</strong></p>
            <p>Ние използваме Google Analytics за събиране на статистическа информация за Ползвателите на Уебсайта... Тук можете да видите пълна информация за компанията и нейната политика за защита на личните данни.</p>
            <p><strong>Facebook Pixel</strong></p>
            <p>Използваме Facebook Pixel... Тук можете да видите пълна информация за компанията и нейната политика за защита на личните данни.</p>
            <p><strong>Email Service Provider</strong></p>
            <p>Нашият e-mail бюлетин... Всеки абонат на бюлетина получава линкове, съдържащи се във всяко писмо от бюлетина, които му дават възможност да види какви негови данни съхраняваме в системата.</p>
            
            <p><strong>Услуги за архивиране</strong></p>
            <p>Използваме услуги за архивиране... Услугите за външно съхранение на данни са:</p>
            <ul className="list-disc list-inside space-y-1">
              <li>Dropbox – пълна информация за компанията и нейната политика за защита на личните данни.</li>
              <li>Google Drive – пълна информация за компанията и нейната политика за защита на личните данни.</li>
            </ul>
            <p><strong>Услуги за споделяне в социални медии</strong></p>
            <p>Предоставяме бутони за лесно споделяне на нашите публикации... Тази информация не включва лични данни и не можете да бъдете идентифициран посредством нея.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Употреба на „бисквитки“ и други проследяващи технологии</h2>
            <p>Ние използваме “бисквитки”... Тези обобщени статистически данни не включват лична информация.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Защита на лични данни</h2>
            <p>Ние гарантираме сигурността на данните... в строго съответствие с приложимото законодателство за конфиденциалност и защита на личните данни.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Предоставяне на лични данни на трети страни</h2>
            <p>Ние НЕ сме и НЯМА да разкриваме вашите лични данни на трети страни... Ние също така можем да разкрием информация, изискуема по съдебен ред или по друг законов начин, или с цел предотвратяване на евентуално увреждане на лица или имущество.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Връзки към електронни страници на трети страни</h2>
            <p>Услугата, както и материали на трети страни, които са публикувани на Уебсайта, съдържат връзки към, и могат да ви позволят да посетите други електронни страници („Електронни страници на трети страни“)... не следва да бъде разглеждан като съгласие с техните политики и практики за защита на личните данни и информационна сигурност.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Достъп и корекция на лични данни</h2>
            <p>Вие можете да достъпвате, коригирате, изменяте или изтривате части от вашите лични данни, като подадете заявка за това на 1001knigi@gmail.com.</p>
            <p>Ние ще запазим вашите данни толкова време, колкото е необходимо за предоставянето на услугите ни или дотогава, докато ни задължава законът. След това вашите данни ще бъдат изтрити.</p>

            <h2 className="font-semibold text-xl text-foreground pt-4">Вашите права за защита на данните</h2>
            <p>Според Общия регламент за защита на данните /GDPR/ имате следните права:</p>
            <ul className="list-disc list-inside space-y-1">
                <li>Право на достъп;</li>
                <li>Право на коригиране;</li>
                <li>Право на изтриване (право „да бъдете забравени“);</li>
                <li>Право на ограничаване на обработката;</li>
                <li>Право на преносимост на данните;</li>
                <li>Право на възражение срещу обработката;</li>
                <li>Право на оттегляне на съгласието по всяко време.</li>
            </ul>
            
            <p><strong>Как да упражните правата си</strong></p>
            <p>За да упражните правата си, можете да се свържете с нас на 1001knigi@gmail.com . Ще отговорим на вашите искания без неоправдано забавяне и най-късно до 1 месец.</p>

            <h2 className="font-semibold text-xl text-foreground pt-4">КАК ОСИГУРЯВАМЕ СИГУРНОСТТА НА ВАШИТЕ ДАННИ</h2>
            <p>Всички ваши лични данни ще бъдат пренасяни чрез SSL (защитен гнездови слой) при 128-битово криптиране (високо) (RSA при 1024 скорост на данните) и поради това трети лица не биха могли да злоупотребят с тях.</p>
            
            <h2 className="font-semibold text-xl text-foreground pt-4">Изменение на тази политика за защита на личните данни</h2>
            <p>Тази Политика за защита на личните данни може да бъде изменяна едностранно от нас... Вие се съгласявате, че всички наши изявления, във връзка с изменението на тази Политика ще бъдат изпращани на вашата електронна поща, използвана за регистрация за Услугата или чрез публикуване на подходящо място на Уебсайта.</p>
            <p className="mt-4">Дата на влизане в сила: 11.03.2026.</p>

          </div>
        </div>
      </main>
      <AppFooter />
    </div>
  );
}
